jose-villegas/autana/launcher/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ESP32-S3R8: 8 MB octal PSRAM, 80 MHz - the fastest mode this die supports.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# This board's one USB-C port is the SoC's own native USB-Serial/JTAG
# peripheral, not an external USB-UART bridge chip on UART0. ESP-IDF's own
# default (CONFIG_ESP_CONSOLE_UART_DEFAULT) assumes that other, more common
# case, and leaves input silently unread on a board wired this way.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 1 kHz tick instead of the 100 Hz default. vTaskDelay(1) is the render loop's
# yield, and at 100 Hz that is a full 10 ms - a quarter of the frame budget.
# It also makes the touch task's 100 Hz polling land accurately rather than
# quantised to the tick.
CONFIG_FREERTOS_HZ=1000

# -O2 rather than the -Og default.
#
# This is a rendering device with no debugger attached: every frame is spent in
# rasterising, cellular automata and pixel loops, which are exactly what an
# optimiser helps and exactly what -Og leaves on the table. Measured effect is
# in docs/notes/Flashing-and-Toolchain.md.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Allocations up to 64 KB try internal RAM before PSRAM (IDF default 16 KB),
# so sand's 41 KB grids and per-step buffers stay off the PSRAM bus. Larger
# ones - the framebuffer - still land in PSRAM. Device, perf scope,
# 2026-09-13: 1-6% faster sand steps.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=65536

# 32 KB instruction cache instead of 16. Same capture: a further 0-5% on
# complex scenes (thermal shock 7% in total) for 16 KB of internal RAM. A
# 64 KB data cache measured exactly nothing once no hot data is in PSRAM.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
